# DATAFRAME
-veri çerçevesi demektir.
-serilerin birleştirilmiş halidir
-pandas içiinde farklı bir yapıdır

In [6]:
import pandas as pd
import numpy as np

In [7]:
data=np.random.rand(4,3)

In [8]:
data

array([[0.82149967, 0.50397407, 0.98867883],
       [0.65662398, 0.04412312, 0.38920673],
       [0.46000203, 0.3085508 , 0.2273147 ],
       [0.67926822, 0.78367741, 0.53426956]])

In [9]:
dataFrame=pd.DataFrame(data)

In [10]:
dataFrame

          0         1         2
0  0.821500  0.503974  0.988679
1  0.656624  0.044123  0.389207
2  0.460002  0.308551  0.227315
3  0.679268  0.783677  0.534270

In [11]:
evın=np.random.rand(5,6)

In [12]:
evın

array([[0.26516686, 0.16560507, 0.39691054, 0.18972884, 0.50169804,
        0.22759335],
       [0.09829409, 0.31356063, 0.38615814, 0.06351151, 0.41969708,
        0.02787844],
       [0.62597071, 0.60923913, 0.15106629, 0.49219908, 0.54842261,
        0.77953448],
       [0.03891914, 0.32958461, 0.69378869, 0.49292639, 0.91968581,
        0.59540997],
       [0.44639645, 0.63718329, 0.20237373, 0.56826799, 0.60470422,
        0.6027965 ]])

In [13]:
dataFramem=pd.DataFrame(evın)

In [14]:
dataFramem

          0         1         2         3         4         5
0  0.265167  0.165605  0.396911  0.189729  0.501698  0.227593
1  0.098294  0.313561  0.386158  0.063512  0.419697  0.027878
2  0.625971  0.609239  0.151066  0.492199  0.548423  0.779534
3  0.038919  0.329585  0.693789  0.492926  0.919686  0.595410
4  0.446396  0.637183  0.202374  0.568268  0.604704  0.602797

In [16]:
YenıDataframe=pd.DataFrame(data,index=["evin","erva","asil","ayşe"],columns=["maas","cinsiyet","yas"])

In [17]:
YenıDataframe

          maas  cinsiyet       yas
evin  0.821500  0.503974  0.988679
erva  0.656624  0.044123  0.389207
asil  0.460002  0.308551  0.227315
ayşe  0.679268  0.783677  0.534270

In [18]:
YenıDataframe["maas"]

evin    0.821500
erva    0.656624
asil    0.460002
ayşe    0.679268
Name: maas, dtype: float64

In [19]:
YenıDataframe[["maas","yas"]]

          maas       yas
evin  0.821500  0.988679
erva  0.656624  0.389207
asil  0.460002  0.227315
ayşe  0.679268  0.534270

In [20]:
# eğer belli bir satırı seçmek istersem LOC kelimesini kullan
YenıDataframe.loc["evin"]

maas        0.821500
cinsiyet    0.503974
yas         0.988679
Name: evin, dtype: float64

In [22]:
# çıkarma işlemi yapabilmek  içinde drop kelimesini kullan kolonu silmek için axixi 1 ver

In [23]:
YenıDataframe.drop("yas",axis=1)

          maas  cinsiyet
evin  0.821500  0.503974
erva  0.656624  0.044123
asil  0.460002  0.308551
ayşe  0.679268  0.783677

In [24]:
YenıDataframe<0

       maas  cinsiyet    yas
evin  False     False  False
erva  False     False  False
asil  False     False  False
ayşe  False     False  False

In [25]:
YenıDataframe>0

      maas  cinsiyet   yas
evin  True      True  True
erva  True      True  True
asil  True      True  True
ayşe  True      True  True

In [26]:
YenıDataframe[["yas"]>0]

TypeError: '>' not supported between instances of 'list' and 'int'

In [32]:
#örneğin ben indekslerin sadece ilk 3 harfini almak istiyorum. bunun için kullanacağım  değişken set index değişkeni oluyor.
YenıIndeksLıstesı=["ahm","meh","ayş","fat"]

In [33]:
YenıDataframe["yeni indeks"]=YenıIndeksLıstesı

In [34]:
YenıDataframe

          maas  cinsiyet       yas yeni indeks
evin  0.821500  0.503974  0.988679         ahm
erva  0.656624  0.044123  0.389207         meh
asil  0.460002  0.308551  0.227315         ayş
ayşe  0.679268  0.783677  0.534270         fat

In [35]:
YenıDataframe.set_index("yeni indeks")

                 maas  cinsiyet       yas
yeni indeks
ahm          0.821500  0.503974  0.988679
meh          0.656624  0.044123  0.389207
ayş          0.460002  0.308551  0.227315
fat          0.679268  0.783677  0.534270

In [36]:
# yaptığımız set işlemlerinin orjinali etkilememesi için inplace değişkenini kullanıyoruz.
YenıDataframe.set_index("yeni indeks",inplace=True)

In [37]:
YenıDataframe

                 maas  cinsiyet       yas
yeni indeks
ahm          0.821500  0.503974  0.988679
meh          0.656624  0.044123  0.389207
ayş          0.460002  0.308551  0.227315
fat          0.679268  0.783677  0.534270